In [74]:
import pandas as pd
import numpy as np

In [75]:
data = pd.read_csv(r'E:\Data Sets -Data Frames\Book12.csv')
data

,Name,Address,Date,Time
0,Prabhas' Residence,"839, Road Number 44, Jubilee Hills, Hyderabad",12/8/1985,6hrs:20min:10sec
1,Mahesh Babu's Residence,"Plot No. 60/A, Road No. 12, Film Nagar, Hydera...",10/8/1995,6hrs:20min:10sec
2,Chiranjeevi's Residence,"Road No. 25, Jubilee Hills, Hyderabad.",15/2/1990,11hrs:12min:17sec
3,Prabhas' Residence,"Plot No. 60/A, Road No. 12, Film Nagar, Hydera...",NaN,NaN
4,Babu's Residence,"839, Road Number 44, Hayatnagar Hills, Hyderabad",NaN,NaN
5,KK Residence,"Plot No. 60/BA, Road No. 12, Film Nagar, Hyder...",NaN,NaN
6,Raj Residence,"8399, Road Number 445, Banjara Hills, Hyderabad",NaN,NaN

In [76]:
data.columns

Index(['Name ', 'Address ', 'Date ', 'Time '], dtype='object')

In [77]:
data['Address ']

0        839, Road Number 44, Jubilee Hills, Hyderabad
1    Plot No. 60/A, Road No. 12, Film Nagar, Hydera...
2               Road No. 25, Jubilee Hills, Hyderabad.
3    Plot No. 60/A, Road No. 12, Film Nagar, Hydera...
4     839, Road Number 44, Hayatnagar Hills, Hyderabad
5    Plot No. 60/BA, Road No. 12, Film Nagar, Hyder...
6      8399, Road Number 445, Banjara Hills, Hyderabad
Name: Address , dtype: object

In [78]:
address_data = data['Address '].str.split(r',' ,expand=True)
address_data

                0                 1                  2            3
0             839    Road Number 44      Jubilee Hills    Hyderabad
1   Plot No. 60/A       Road No. 12         Film Nagar   Hyderabad.
2     Road No. 25     Jubilee Hills         Hyderabad.         None
3   Plot No. 60/A       Road No. 12         Film Nagar   Hyderabad.
4             839    Road Number 44   Hayatnagar Hills    Hyderabad
5  Plot No. 60/BA       Road No. 12         Film Nagar   Hyderabad.
6            8399   Road Number 445      Banjara Hills    Hyderabad

In [79]:
address_data.columns = ['StreetName','RoadNo','City','State']
address_data.columns

Index(['StreetName', 'RoadNo', 'City', 'State'], dtype='object')

In [80]:
print(address_data)

       StreetName            RoadNo               City        State
0             839    Road Number 44      Jubilee Hills    Hyderabad
1   Plot No. 60/A       Road No. 12         Film Nagar   Hyderabad.
2     Road No. 25     Jubilee Hills         Hyderabad.         None
3   Plot No. 60/A       Road No. 12         Film Nagar   Hyderabad.
4             839    Road Number 44   Hayatnagar Hills    Hyderabad
5  Plot No. 60/BA       Road No. 12         Film Nagar   Hyderabad.
6            8399   Road Number 445      Banjara Hills    Hyderabad

In [81]:
data['Date ']

0    12/8/1985
1    10/8/1995
2    15/2/1990
3          NaN
4          NaN
5          NaN
6          NaN
Name: Date , dtype: object

In [82]:
date_data = data['Date '].str.split('/',expand=True)
date_data

     0    1     2
0   12    8  1985
1   10    8  1995
2   15    2  1990
3  NaN  NaN   NaN
4  NaN  NaN   NaN
5  NaN  NaN   NaN
6  NaN  NaN   NaN

In [83]:
date_data.columns = ['Date','Month','Year']
date_data.columns

Index(['Date', 'Month', 'Year'], dtype='object')

In [84]:
print(date_data)

  Date Month  Year
0   12     8  1985
1   10     8  1995
2   15     2  1990
3  NaN   NaN   NaN
4  NaN   NaN   NaN
5  NaN   NaN   NaN
6  NaN   NaN   NaN

In [85]:
data['Time ']

0     6hrs:20min:10sec
1     6hrs:20min:10sec
2    11hrs:12min:17sec
3                  NaN
4                  NaN
5                  NaN
6                  NaN
Name: Time , dtype: object

In [86]:
data.rename(columns={'Time ': 'Time'}, inplace=True)

In [87]:
data['Time']

0     6hrs:20min:10sec
1     6hrs:20min:10sec
2    11hrs:12min:17sec
3                  NaN
4                  NaN
5                  NaN
6                  NaN
Name: Time, dtype: object

In [88]:
data_time = data['Time'].str.split(':',expand=True)

In [91]:
data_time.columns = ['Hours','Minutes','Seconds']
data_time.columns

Index(['Hours', 'Minutes', 'Seconds'], dtype='object')

In [93]:
data_time

   Hours Minutes Seconds
0   6hrs   20min   10sec
1   6hrs   20min   10sec
2  11hrs   12min   17sec
3    NaN     NaN     NaN
4    NaN     NaN     NaN
5    NaN     NaN     NaN
6    NaN     NaN     NaN